
Python is a great general-purpose programming language on its own, but with the help of a few popular libraries (numpy, PANDAS, matplotlib) it becomes a powerful environment for scientific computing.

 # PANDAS

Pandas is one of the most popular Python libraries for Data Science and Analytics. I like to say it’s the “SQL of Python.” Why? Because pandas helps you to manage two-dimensional data tables in Python. Of course, it has many more features.

### The first few lines of code is to import these libraries into your Jupyter notebook.

In [3]:
import numpy as np
import pandas as pd

Okay, now we have everything! Let’s start with this pandas tutorial!
The first question is:How to open data files in pandas?
In this pandas tutorial, I’ll focus mostly on DataFrames. The reason is simple: most of the analytical methods I will talk about will make more sense in a 2D datatable than in a 1D array.

Okay, time to put things into practice! Let’s load a .csv data file into pandas!
There is a function for it, called read_csv().

### Import the file name zoo.csv to this jupyter notebook using read.csv() function.

In [2]:
import pandas as pd
pd.read_csv("zoo.csv")

     2018-01-01 00:01:01;read;country_7;2458151261;SEO;North America
0     2018-01-01 00:03:20;read;country_7;2458151262;...
1     2018-01-01 00:04:01;read;country_7;2458151263;...
2     2018-01-01 00:04:02;read;country_7;2458151264;...
3     2018-01-01 00:05:03;read;country_8;2458151265;...
4     2018-01-01 00:05:42;read;country_6;2458151266;...
...                                                 ...
1789  2018-01-01 23:57:14;read;country_2;2458153051;...
1790  2018-01-01 23:58:33;read;country_8;2458153052;...
1791  2018-01-01 23:59:36;read;country_6;2458153053;...
1792  2018-01-01 23:59:36;read;country_7;2458153054;...
1793  2018-01-01 23:59:38;read;country_5;2458153055;...

[1794 rows x 1 columns]

Does something feel off? Yes, this time we didn’t have a header in our csv file, so we have to set it up manually! 


### Add the names parameter to your function!

In [4]:
from pandas import read_csv      
a = read_csv('zoo.csv')
a.columns = ['header']

Better!
And with that, we finally loaded our .csv data into a pandas dataframe!



### Make a variable to store the read.csv() function named as article_read().

In [5]:
article_read = pd.read_csv('zoo.csv', delimiter=';', names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])

In [6]:
article_read

              my_datetime event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

#### Sometimes, it’s handy not to print the whole dataframe and flood your screen with data. When a few lines is enough, you can print only the first 5 lines – by using the head(),tail() or sample() functions of pandas library.

In [9]:
article_read.head()
article_read.tail()
article_read.sample(5)

             my_datetime event    country     user_id   source          topic
757  2018-01-01 10:11:11  read  country_2  2458152018   Reddit  North America
974  2018-01-01 13:03:17  read  country_5  2458152235   Reddit           Asia
783  2018-01-01 10:35:55  read  country_5  2458152044      SEO  South America
129  2018-01-01 01:53:59  read  country_2  2458151390   Reddit  North America
745  2018-01-01 10:04:56  read  country_1  2458152006  AdWords           Asia

In [10]:
article_read[['country', 'user_id']]

        country     user_id
0     country_7  2458151261
1     country_7  2458151262
2     country_7  2458151263
3     country_7  2458151264
4     country_8  2458151265
...         ...         ...
1790  country_2  2458153051
1791  country_8  2458153052
1792  country_6  2458153053
1793  country_7  2458153054
1794  country_5  2458153055

[1795 rows x 2 columns]

article_read.sample(5)

Now,Let’s say you want to print the ‘country’ and the ‘user_id’ columns only.
You should use this syntax:

In [11]:
article_read[['country', 'user_id']]

        country     user_id
0     country_7  2458151261
1     country_7  2458151262
2     country_7  2458151263
3     country_7  2458151264
4     country_8  2458151265
...         ...         ...
1790  country_2  2458153051
1791  country_8  2458153052
1792  country_6  2458153053
1793  country_7  2458153054
1794  country_5  2458153055

[1795 rows x 2 columns]

 Filter for specific values in your dataframe.

Let’s say, you want to see a list of only the users who came from the ‘country_7’ source. In this case you have to filter for the ‘country_7’ value in the ‘country’ column:

In [12]:
article_read[article_read.country == '7']

Empty DataFrame
Columns: [my_datetime, event, country, user_id, source, topic]
Index: []

## So, now a short assignment to test the understanding of all the above functions!

##### Select the user_id, the country and the topic columns for the users who are from country_2! Print the first five rows only!

In [37]:
article_read[article_read.country == '2'][['user_id','country','topic']].head

       user_id   topic    country
6   2458151267  Europe  country_2
13  2458151274  Europe  country_2
17  2458151278    Asia  country_2
19  2458151280    Asia  country_2
20  2458151281    Asia  country_2